#include <stdio.h>
int main () {
	char a = 60;
	char b = -13;
	/*
		整形常量在在存储时是以 int 类型的大小存储的 
		a    = 0011 1100 （二进制形式）
			   0011 1100 （正数的二进制，即二进制补码）
		a>>2 = 0000 1111 = 60 / (2 * 2) = 15
		a<<2 = 1111 0000 = 60 *2 *2 = 240
	*/
    // 正数的右移、左移,最高位为数值位
	printf("a>>2 = %d\n", a>>2); // 15
	printf("a<<2 = %d\n", a<<2); // 240
	/*
		|b| = 0000 1101 (先写为绝对值形式二进制)
		      1111 0010 (按位取反)
			  1111 0011 (加1，得负数二进制补码)
		b>>2 = 1111 1100 （二进制补码）
		b   =  1000 0100 = -4 (最高位不变,其余位按位取反,在加1,得二进制形式)
		b<<2 = 1100 1100 （二进制补码）
		b   =  1011 0100 = -52
	*/
    // 负数的右移、左移,最高位为符号位
	printf("b>>2 = %d\n", b>>2); // -4
	printf("b<<2 = %d\n", b<<2); // -52
	return 0;
}
